br3/rails/diary/app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entries = Entry.all

INSERT INTO "entries" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "title"], ["content", "content"], ["created_at", "2024-04-25 03:41:18.792778"], ["updated_at", "2024-04-25 03:41:18.792778"]]
---
  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save

DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]
---
  def destroy
    @entry.destroy!

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_entry
      @entry = Entry.find(params[:id])